dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioTxHandler.c
/*
 * Copyright (c) 2023 dresden elektronik ingenieurtechnik gmbh.
 * All rights reserved.
 *
 * The software in this package is published under the terms of the BSD
 * style license a copy of which has been included with this distribution in
 * the LICENSE.txt file.
 *
 */
#include "samr21RadioTxHandler.h"

static TxStatus s_txStatus = TX_STATUS_IDLE;

static uint8_t s_txFramePsdu[IEEE_802_15_4_FRAME_SIZE];
static uint8_t s_txAckPsdu[IEEE_802_15_4_FRAME_SIZE];

static otRadioFrame s_txFrame = {.mPsdu = &s_txFramePsdu[1]};
static otRadioFrame s_txAckFrame = {.mPsdu = &s_txAckPsdu[1]};

static struct
{
    uint8_t numCsmaBackoffs;
    uint8_t numTransmissionRetrys;
    uint8_t numPsduBytesUploaded;

} s_currentTransmission;

static struct
{
    bool securityHeaderPresent;
    bool needsEncryption;

    uint8_t *header;
    uint8_t headerLen;

    uint8_t *payload;
    uint8_t payloadLen;

    uint8_t *mic;
    uint8_t micSize;

    uint8_t *pendingAesResultBuffer;

    uint8_t nonce[IEEE_802_15_4_NONCE_SIZE_BYTES];
    uint8_t encryptionBlocks[(IEEE_802_15_4_FRAME_SIZE / AES_BLOCK_SIZE)][AES_BLOCK_SIZE];

    uint8_t ctrBlock[AES_BLOCK_SIZE];

    struct
    {
        uint8_t numEncryptionBlocks;
        uint8_t numProcessedEncryptionBlocks;
    } ctr;

    uint8_t cbcBlock[AES_BLOCK_SIZE];

    struct
    {
        uint8_t currentBlockLen;
        uint8_t numProcessedHeaderBytes;
        uint8_t numProcessedPayloadBytes;
    } cbc;

} s_currentTransmissionSecurity;

volatile bool s_txHandlerActive = false;

bool samr21RadioTxBusy()
{
    return ((s_txStatus == TX_STATUS_IDLE || s_txStatus == TX_STATUS_DONE) ? false : true);
}

void samr21RadioTxAbortRetrys()
{
    if (samr21RadioTxBusy())
    {
        s_currentTransmission.numCsmaBackoffs = 0xFF;
        s_currentTransmission.numTransmissionRetrys = 0xFF;
    }
}

otRadioFrame *samr21RadioTxGetOtBuffer()
{
    return &s_txFrame;
}

otRadioFrame *samr21RadioTxGetAckOtBuffer()
{
    return &s_txAckFrame;
}

void samr21RadioTxCleanup(bool success)
{
    samr21Timer4Stop();
    samr21RadioRemoveEventHandler();

    samr21RadioCtrlReturnToLastHandler();
    s_txHandlerActive = false;

    if (!success)
    {
        cb_samr21RadioTxFailed(&s_txFrame, s_txStatus);
    }
    else
    {
        cb_samr21RadioTxDone(&s_txFrame, &s_txAckFrame);
    }
    s_txStatus = TX_STATUS_IDLE;
}

static void samr21RadioTxStartCCA()
{
    s_txStatus = TX_STATUS_CCA;

    // Check if Transciver is in recive state
    if (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
    {
        samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);
        while (g_trxStatus.bit.trxStatus != TRX_STATUS_RX_ON)
        {
            samr21TrxUpdateStatus();
        }
    }

    // Prepare CCA Measurment
    g_phyCcCcaReg.bit.ccaRequest = 1;

    // Start CCA Measurment
    samr21TrxWriteRegister(PHY_CC_CCA_REG, g_phyCcCcaReg.reg);

    // Reset local copy of ccaRequest Bit
    g_phyCcCcaReg.bit.ccaRequest = 0;

    // Start CCA TimeoutTimer
    samr21Timer4Set(TIMEOUT_CCA_us);
}

static void samr21RadioTxStart()
{
    s_currentTransmission.numCsmaBackoffs = 0;
    s_currentTransmission.numTransmissionRetrys = 0;

    samr21RadioTxStartCCA();
}

bool samr21RadioTxSetup()
{
    if (s_txHandlerActive)
    {
        return false;
    }

    while (samr21RadioRxBusy())
        ;

    s_currentTransmission.numPsduBytesUploaded = 0;
    s_txFrame.mPsdu[-1] = s_txFrame.mLength;

    s_currentTransmissionSecurity.securityHeaderPresent = (otMacFrameIsSecurityEnabled(&s_txFrame) ? true : false);

    if (!s_txFrame.mInfo.mTxInfo.mIsARetx && !s_txFrame.mInfo.mTxInfo.mIsHeaderUpdated && s_currentTransmissionSecurity.securityHeaderPresent)
    {
        __disable_irq();
        otMacFrameSetFrameCounter(&s_txFrame, g_macFrameCounter++);

        if (otMacFrameIsKeyIdMode1(&s_txFrame))
        {
            otMacFrameSetKeyId(&s_txFrame, g_currKeyId);
            s_txFrame.mInfo.mTxInfo.mAesKey = (const otMacKeyMaterial *)g_currKey;
        }
        __enable_irq();
    }

    samr21RadioSetEventHandler(&samr21RadioTxEventHandler);
    s_txHandlerActive = true;

    // Set relevant IRQ Mask
    g_irqMask = (AT86RF233_REG_IRQ_MASK_t){
        .bit.pllLock = 0,
        .bit.pllUnlock = 0,
        .bit.rxStart = 1,
        .bit.trxEnd = 1,
        .bit.ccaEdDone = 1,
        .bit.addressMatch = 0,
        .bit.bufferUnderRun = 0,
        .bit.batteryLow = 0};
    samr21TrxWriteRegister(IRQ_MASK_REG, g_irqMask.reg);

    g_phyCcCcaReg.bit.channel = s_txFrame.mChannel;
    samr21TrxWriteRegister(PHY_CC_CCA_REG, g_phyCcCcaReg.reg);

    if (s_txFrame.mInfo.mTxInfo.mTxDelay)
    {
        uint32_t diffTime = samr21RtcGetTimestamp() - s_txFrame.mInfo.mTxInfo.mTxDelayBaseTime;

        if (diffTime > s_txFrame.mInfo.mTxInfo.mTxDelay)
        {
            goto txStart;
        }
        else
        {
            s_txStatus = TX_STATUS_WAIT_FOR_DELAYED_START;
            samr21Timer4Set(s_txFrame.mInfo.mTxInfo.mTxDelay - diffTime);
            return true;
        }
    }

txStart:
    samr21RadioTxStart();
    return true;
}

static void samr21RadioTxRetry()
{
    if (s_currentTransmission.numTransmissionRetrys < s_txFrame.mInfo.mTxInfo.mMaxFrameRetries)
    {
        s_currentTransmission.numTransmissionRetrys++;
        s_currentTransmission.numCsmaBackoffs = 0;

        uint32_t backoffTime_us =
            ((samr21TrxGetRandomByte() >> (8 - (g_csmaBackoffExponentMin + s_currentTransmission.numCsmaBackoffs > g_csmaBackoffExponentMax ? g_csmaBackoffExponentMax : g_csmaBackoffExponentMin + s_currentTransmission.numCsmaBackoffs))) - 1) * (20 * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us);

        s_txStatus = TX_STATUS_CSMA_BACKOFF;
        samr21Timer4Set(backoffTime_us + 1000);
        return;
    }
    samr21RadioTxCleanup(false);
}

static void samr21RadioTxUploadAllRaw()
{
    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_WRITE, NULL);
    samr21TrxSpiTransceiveBytesRaw(&s_txFrame.mPsdu[-1], NULL, s_txFrame.mLength - 1); // -2 FCS +1 PhyLen
    samr21TrxSpiCloseAccess();

    s_currentTransmission.numPsduBytesUploaded = s_txFrame.mLength;

    // Queue Move to RX (For ACK) in advance, this will only executes after TX is done
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);

    s_txStatus = TX_STATUS_SENDING_WAIT_TRX_END;
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioTxUploadHeader()
{

    // Write via SRAM starting from Addr 0x00 of Framebuffer (->phyLen)
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, 0x00);
    samr21TrxSpiTransceiveBytesRaw(&s_txFrame.mPsdu[-1], NULL, s_currentTransmissionSecurity.headerLen + 1); // phyLen not in psduLen
    samr21TrxSpiCloseAccess();

    s_currentTransmission.numPsduBytesUploaded = s_currentTransmissionSecurity.headerLen;
    s_txStatus = TX_STATUS_SENDING_UPLOADED_HEADER;
}

