dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioTxHandler.c
static void samr21RadioTxUploadPayload()
{
    s_currentTransmissionSecurity.ctr.numEncryptionBlocks = s_currentTransmissionSecurity.payloadLen / AES_BLOCK_SIZE;
    s_currentTransmissionSecurity.ctr.numEncryptionBlocks += (s_currentTransmissionSecurity.payloadLen % AES_BLOCK_SIZE ? 1 : 0);

    if (s_currentTransmissionSecurity.needsEncryption)
    {
        samr21delaySysTick(700); // Wait for first AES-ECB to finish
    }

    while (s_currentTransmissionSecurity.ctr.numEncryptionBlocks > s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks)
    {
        // Save some Time if no encryption is needed
        if (s_currentTransmissionSecurity.needsEncryption)
        {
            // increase Nonce Counter
            s_currentTransmissionSecurity.ctrBlock[(AES_BLOCK_SIZE - 1)]++;
            // start uploading next AES Block, while reading the result of the last Block
            samr21RadioAesEcbEncrypt(s_currentTransmissionSecurity.ctrBlock, s_currentTransmissionSecurity.pendingAesResultBuffer);

            s_currentTransmissionSecurity.pendingAesResultBuffer =
                s_currentTransmissionSecurity.encryptionBlocks[s_currentTransmissionSecurity.ctrBlock[(AES_BLOCK_SIZE - 1)]];
        }
        s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks++;

        // While AES is busy, an encrypted payload-block can be uploaded
        // This gives headroom for longer AES Operation, while simultaniusly topping of the FrameBuffer

        // Write via SRAM starting from Addr of the current Byte to the Framebuffer
        samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentTransmission.numPsduBytesUploaded + 1)); // phyLen not in psduLen

        for (uint8_t i = 0; i < AES_BLOCK_SIZE; i++)
        {
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
            samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
            // Upload (encrypted) payload to Framebuffer
            if (s_currentTransmissionSecurity.needsEncryption)
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_txFrame.mPsdu[s_currentTransmission.numPsduBytesUploaded++] ^ s_currentTransmissionSecurity.encryptionBlocks[s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks][i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_txFrame.mPsdu[s_currentTransmission.numPsduBytesUploaded++]);
            }

            if (s_currentTransmission.numPsduBytesUploaded >= (s_currentTransmissionSecurity.headerLen + s_currentTransmissionSecurity.payloadLen))
            {
                break;
            }
        }

        samr21TrxSpiCloseAccess();
    }
    if (s_currentTransmissionSecurity.needsEncryption)
    {
        // get Last Payload encryptionBlock and start MIC encryptionBlock
        s_currentTransmissionSecurity.ctrBlock[(AES_BLOCK_SIZE - 1)] = 0; ////The Nonce for MIC encryption has the CTR value 0
        samr21RadioAesEcbEncrypt(s_currentTransmissionSecurity.ctrBlock, s_currentTransmissionSecurity.pendingAesResultBuffer);
        s_currentTransmissionSecurity.pendingAesResultBuffer =
            s_currentTransmissionSecurity.encryptionBlocks[s_currentTransmissionSecurity.ctrBlock[(AES_BLOCK_SIZE - 1)]];
    }
    s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks++;

    // Upload Last Payload-Chunk to be encrypted befor MIC
    if (s_currentTransmission.numPsduBytesUploaded < (s_currentTransmissionSecurity.headerLen + s_currentTransmissionSecurity.payloadLen))
    {
        // Write via SRAM starting from Addr of the current Byte to the Framebuffer
        samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentTransmission.numPsduBytesUploaded + 1)); // phyLen not in psduLen

        for (uint8_t i = 0; i < AES_BLOCK_SIZE; i++)
        {

            // Upload remaining to Framebuffer
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
            samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
            if (s_currentTransmissionSecurity.needsEncryption)
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_txFrame.mPsdu[s_currentTransmission.numPsduBytesUploaded++] ^ s_currentTransmissionSecurity.encryptionBlocks[s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks][i]);
            }
            else
            {
                samr21TrxSpiTransceiveByteRaw(
                    s_txFrame.mPsdu[s_currentTransmission.numPsduBytesUploaded++]);
            }

            // Break if entire payload is uploaded
            if (s_currentTransmission.numPsduBytesUploaded >= (s_currentTransmissionSecurity.headerLen + s_currentTransmissionSecurity.payloadLen))
            {
                break;
            }
        }
        samr21TrxSpiCloseAccess();
    }
    else
    {
        if (s_currentTransmissionSecurity.needsEncryption)
        {
            samr21delaySysTick(700); // Wait for first AES-ECB to finish
        }
    }
    s_txStatus = TX_STATUS_SENDING_UPLOADED_PAYLOAD;
}

// this function gets triggered once by the main handler and after by a Timer.
// this is because there is nothing to do while the AES-Engine is busy
static void samr21RadioTxCalcMic()
{

    // Only executed on first Round
    if (s_txStatus != TX_STATUS_SENDING_BUSY_MIC)
    {

        s_txStatus = TX_STATUS_SENDING_BUSY_MIC;
        // Form init Vektor (See IEEE 802.15.4-2015 Appendix B for good examples)
        s_currentTransmissionSecurity.cbcBlock[0] =
            (s_currentTransmissionSecurity.headerLen != 0 ? 0b01000000 : 0x0) | (((s_currentTransmissionSecurity.micSize - 2) >> 1) << 3) | 1; // L always 2
        s_currentTransmissionSecurity.cbcBlock[14] = 0;                                                                                        // always 0 cause maxlenght is 127
        s_currentTransmissionSecurity.cbcBlock[15] = s_currentTransmissionSecurity.payloadLen;
        memcpy(&s_currentTransmissionSecurity.cbcBlock[1], s_currentTransmissionSecurity.nonce, 13);

