dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioTxHandler.c
        // start the first CBC-Round  (plain ECB, r21 datasheet 40.1.4.2 Cipher Block Chaining (CBC))
        // simultaneously retrieve the MIC encryptionBlock from the CTR-Section ()
        samr21RadioAesEcbEncrypt(s_currentTransmissionSecurity.cbcBlock, s_currentTransmissionSecurity.pendingAesResultBuffer);
        samr21Timer4Set(21); // AES-Engine takes 21us

        // Only the result of the last CBC Round is of interest
        // The output of the rounds in between can be discarded
        s_currentTransmissionSecurity.pendingAesResultBuffer = NULL;

        s_currentTransmissionSecurity.cbcBlock[0] = s_currentTransmissionSecurity.headerLen >> 8;
        s_currentTransmissionSecurity.cbcBlock[1] = s_currentTransmissionSecurity.headerLen >> 0;

        s_currentTransmissionSecurity.cbc.currentBlockLen = 2;
        s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes = 0;
        s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes = 0;

        goto fillNextBlock;
    }

    // Still Rounds to go
    if (
        s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentTransmissionSecurity.headerLen || s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentTransmissionSecurity.payloadLen)
    {
        samr21RadioAesCbcEncrypt(s_currentTransmissionSecurity.cbcBlock, AES_BLOCK_SIZE, NULL);
        s_currentTransmissionSecurity.cbc.currentBlockLen = 0;
        samr21Timer4Set(21); // AES takes 21us
        goto fillNextBlock;
    }

    // This is the last CBC Round the result of this is the (unencrypted!) MIC
    if (
        s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes == s_currentTransmissionSecurity.headerLen || s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes == s_currentTransmissionSecurity.payloadLen)
    {
        samr21RadioAesCbcEncrypt(s_currentTransmissionSecurity.cbcBlock, AES_BLOCK_SIZE, NULL);
        s_currentTransmissionSecurity.cbc.currentBlockLen = 0;
        s_currentTransmissionSecurity.pendingAesResultBuffer = s_currentTransmissionSecurity.cbcBlock; // Put the result back into the cbcBlockBuffer
        samr21Timer4Set(21);                                                                           // AES takes 21us

        s_txStatus = TX_STATUS_SENDING_WAIT_FOR_MIC;
        return;
    }

fillNextBlock:

    // Fill CBC-Input-Block with Header, pad remainder with 0x00.
    if (s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentTransmissionSecurity.headerLen)
    {
        while (s_currentTransmissionSecurity.cbc.currentBlockLen < AES_BLOCK_SIZE)
        {
            s_currentTransmissionSecurity.cbcBlock[s_currentTransmissionSecurity.cbc.currentBlockLen++] =
                (s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes < s_currentTransmissionSecurity.headerLen ? s_currentTransmissionSecurity.header[s_currentTransmissionSecurity.cbc.numProcessedHeaderBytes++]
                                                                                                                     : 0x00);
        }
        return;
    }
    // Fill CBC-Input-Block with Payload, pad remainder with 0x00.
    if (s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentTransmissionSecurity.payloadLen)
    {
        while (s_currentTransmissionSecurity.cbc.currentBlockLen < AES_BLOCK_SIZE)
        {
            s_currentTransmissionSecurity.cbcBlock[s_currentTransmissionSecurity.cbc.currentBlockLen++] =
                (s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes < s_currentTransmissionSecurity.payloadLen ? s_currentTransmissionSecurity.payload[s_currentTransmissionSecurity.cbc.numProcessedPayloadBytes++]
                                                                                                                       : 0x00);
        }
        return;
    }
}

static void samr21RadioTxUploadMic()
{

    samr21RadioAesCbcEncrypt(NULL, AES_BLOCK_SIZE, s_currentTransmissionSecurity.cbcBlock); // TODO REMOVE USELESS RUN REQUEST

    // Write via SRAM starting from Addr of the current Byte to the Framebuffer (->footer)
    samr21TrxSpiStartAccess(AT86RF233_CMD_SRAM_WRITE, (uint8_t)(s_currentTransmission.numPsduBytesUploaded + 1)); // phyLen not in psduLen

    for (uint8_t i = 0; i < s_currentTransmissionSecurity.micSize; i++)
    {

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
        samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
        if (s_currentTransmissionSecurity.needsEncryption)
        {
            samr21TrxSpiTransceiveByteRaw(
                s_currentTransmissionSecurity.cbcBlock[i] ^ s_currentTransmissionSecurity.encryptionBlocks[0][i]); // MIC is encrypted with CTR Block i=0
            s_currentTransmission.numPsduBytesUploaded++;
        }
        else
        {
            samr21TrxSpiTransceiveByteRaw(
                s_currentTransmissionSecurity.cbcBlock[i]);
            s_currentTransmission.numPsduBytesUploaded++;
        }
    }
    samr21TrxSpiCloseAccess();

    s_txStatus = TX_STATUS_SENDING_WAIT_TRX_END;
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);

    // Queue Move to RX (For ACK) in advance, this will only executes after TX is done
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);

}

static void samr21RadioTxStartTransmission()
{

    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_FORCE_PLL_ON);

    while (g_trxStatus.bit.trxStatus != TRX_STATUS_PLL_ON)
    {
        samr21TrxUpdateStatus();
    }

    // Start Transmission in advance, there is some spare time while the Preamble and SFD is transmitted
    samr21TrxSetSLP_TR(true);
    PORT->Group[0].OUTSET.reg = PORT_PA06;

    if (!s_txFrame.mInfo.mTxInfo.mIsHeaderUpdated)
    {

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
        // Add CSL-IE
        if ((g_cslPeriod > 0) && !s_txFrame.mInfo.mTxInfo.mIsARetx && s_txFrame.mInfo.mTxInfo.mCslPresent)
        {
            otMacFrameSetCslIe(&s_txFrame, (uint16_t)g_cslPeriod, samr21RadioCtrlCslGetPhase());
        }
#endif

#if OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
        // Add Time-IE
        if (s_txFrame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset != 0)
        {
            uint8_t *timeIe = s_txFrame.mPsdu + s_txFrame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset;
            uint64_t time = samr21RtcGetTimestamp() + s_txFrame.mInfo.mTxInfo.mIeInfo->mNetworkTimeOffset;

            *timeIe = s_txFrame.mInfo.mTxInfo.mIeInfo->mTimeSyncSeq;

            *(++timeIe) = (uint8_t)(time & 0xff);
            for (uint8_t i = 1; i < sizeof(uint64_t); i++)
            {
                time = time >> 8;
                *(++timeIe) = (uint8_t)(time & 0xff);
            }
        }
#endif // OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
    }

