dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioTxHandler.c
    // Transmission should have started here allrdy so trigger can be pulled low again
    samr21TrxSetSLP_TR(false);

    if (!s_currentTransmissionSecurity.securityHeaderPresent || s_txFrame.mInfo.mTxInfo.mIsSecurityProcessed)
    {
        // If there is no Security processing needed, the frame can just be uploaded
        samr21RadioTxUploadAllRaw();
        return;
    }

    // Get some Markers for AES
    s_currentTransmissionSecurity.header = otMacFrameGetHeader(&s_txFrame);
    s_currentTransmissionSecurity.payload = otMacFrameGetPayload(&s_txFrame);
    s_currentTransmissionSecurity.mic = otMacFrameGetFooter(&s_txFrame);

    s_currentTransmissionSecurity.headerLen = s_currentTransmissionSecurity.payload - s_txFrame.mPsdu; // calc offset between pointers
    s_currentTransmissionSecurity.payloadLen = s_currentTransmissionSecurity.mic - s_currentTransmissionSecurity.payload;

    // Upload only the unencrypted Header Part first
    // This gives some Headroom to perform AES-CCM*
    samr21RadioTxUploadHeader();

    uint8_t securityLevel = (s_txFrame.mInfo.mTxInfo.mIsSecurityProcessed ? 0b000 : otMacFrameGetSecurityLevel(&s_txFrame));

    s_currentTransmissionSecurity.needsEncryption = (securityLevel & 0b100 ? 1 : 0);

    switch (securityLevel & 0b11)
    {
    case 0b00:
        s_currentTransmissionSecurity.micSize = 0;
        break;

    case 0b01:
        s_currentTransmissionSecurity.micSize = 4;
        break;

    case 0b10:
        s_currentTransmissionSecurity.micSize = 8;
        break;

    case 0b11:
        s_currentTransmissionSecurity.micSize = 16;
        break;
    }

    // Generate Nonce and first EncryptionBlock if needed (TRX is busy with sending Preamble and SFD anyways)
    if (securityLevel)
    {
        otMacGenerateNonce(&s_txFrame, (uint8_t *)(&g_extAddr), s_currentTransmissionSecurity.nonce);
        samr21RadioAesKeySetup(g_currKey);

        if (s_currentTransmissionSecurity.needsEncryption)
        {

            s_currentTransmissionSecurity.ctrBlock[0] = 1; // Always 1 cause L is always 2
            memcpy(&s_currentTransmissionSecurity.ctrBlock[1], s_currentTransmissionSecurity.nonce, IEEE_802_15_4_NONCE_SIZE_BYTES);

            s_currentTransmissionSecurity.ctrBlock[AES_BLOCK_SIZE - 2] = 0;
            s_currentTransmissionSecurity.ctrBlock[AES_BLOCK_SIZE - 1] = 1; // Start with ctr = 1, because timing for payload encryption is crucial

            // Start generating the encrytion mask for the first block
            // The AES-Engine of the at86rf233 takes 21us per Block
            samr21RadioAesEcbEncrypt(s_currentTransmissionSecurity.ctrBlock, NULL);

            s_currentTransmissionSecurity.ctr.numProcessedEncryptionBlocks = 0;
            s_currentTransmissionSecurity.pendingAesResultBuffer =
                s_currentTransmissionSecurity.encryptionBlocks[s_currentTransmissionSecurity.ctrBlock[(AES_BLOCK_SIZE - 1)]];
        }
    }

    // Only Executed if Auth but no Encryption is needed!
    // Otherwise this gets called by a timer after the first AES-Operation finishes
    // Upload the Payload next.
    samr21RadioTxUploadPayload();

    if (s_currentTransmissionSecurity.micSize)
    {
        // Start the Calculation of the MIC. This take Time (~60us * ( 2 + psduLen/16 ) )
        // While the AES-Engine is Busy there is not a lot to do.
        // Because of that, this Secetion is relauched Multiple Times by a Timer-IRQ
        // We just start the first Round here and wait for the said Timer-IRQ (See TxEventHandler)
        // If Encryption is enabled, the AES-Buffer should hold the result for the CTR=0 Encrytion Block (needed for MIC encryption)
        samr21RadioTxCalcMic();
        return;
    }

    // FCS is appended by at86rf233

    // Queue Move to RX (For ACK) in advance, this will only executes after TX is done
    samr21TrxWriteRegister(TRX_STATE_REG, TRX_CMD_RX_ON);

    s_txStatus = TX_STATUS_SENDING_WAIT_TRX_END;
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioTxEvalCCA()
{
    // Clear CCA TimeoutTimer
    samr21Timer4Stop();

    if (g_trxStatus.bit.ccaStatus)
    {
        samr21RadioTxStartTransmission();
        return;
    }

    if (
        s_currentTransmission.numCsmaBackoffs < s_txFrame.mInfo.mTxInfo.mMaxCsmaBackoffs && s_txFrame.mInfo.mTxInfo.mCsmaCaEnabled)
    {
        uint32_t backoffTime_us =
            ((samr21TrxGetRandomByte() >> (8 - (g_csmaBackoffExponentMin + s_currentTransmission.numCsmaBackoffs > g_csmaBackoffExponentMax ? g_csmaBackoffExponentMax : g_csmaBackoffExponentMin + s_currentTransmission.numCsmaBackoffs))) - 1) * (20 * IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us);
        s_currentTransmission.numCsmaBackoffs++;

        s_txStatus = TX_STATUS_CSMA_BACKOFF;
        samr21Timer4Set(backoffTime_us);
        return;
    }

    samr21RadioTxCleanup(false);
}

static void samr21RadioTxPrepareAckReception()
{
    samr21Timer4Stop();
    if (otMacFrameIsAckRequested(&s_txFrame))
    {
        s_txStatus = TX_STATUS_WAIT_FOR_ACK;
        samr21Timer4Set(g_txAckTimeout_us);
        return;
    }
    s_txStatus = TX_STATUS_DONE;
    samr21RadioTxCleanup(true);
}

static void samr21RadioTxAckReceptionStarted()
{
    samr21Timer4Stop();
    s_txAckFrame.mInfo.mRxInfo.mTimestamp = samr21RtcGetTimestamp();
    s_txStatus = TX_STATUS_RECEIVING_ACK;

    // Timeout for Ack Reception
    samr21Timer4Set(IEEE_802_15_4_24GHZ_TIME_PER_OCTET_us * IEEE_802_15_4_FRAME_SIZE);
}

static void samr21RadioTxEvalAck()
{
    // Clear Timeout for Ack Reception
    samr21Timer4Stop();

    samr21TrxSpiStartAccess(AT86RF233_CMD_FRAMEBUFFER_READ, 0);

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    s_txAckFrame.mLength = samr21TrxSpiReadByteRaw();

    if (s_txAckFrame.mLength > IEEE_802_15_4_PDSU_SIZE)
    {
        samr21TrxSpiCloseAccess();
        goto ackInvalid;
    }

    // Download PDSU
    samr21TrxSpiTransceiveBytesRaw(NULL, s_txAckFrame.mPsdu, s_txAckFrame.mLength);

// Dowload LQI, RSSI and CRC Check (r21 Datasheet 35.3.2 -  Frame Buffer Access Mode)
#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    s_txAckFrame.mInfo.mRxInfo.mLqi = samr21TrxSpiReadByteRaw();

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    s_txAckFrame.mInfo.mRxInfo.mRssi = AT86RF233_RSSI_BASE_VAL + samr21TrxSpiReadByteRaw();

#ifdef __CONSERVATIVE_TRX_SPI_TIMING__
    samr21delaySysTick(CPU_WAIT_CYCLES_BETWEEN_BYTES);
#endif
    AT86RF233_REG_RX_STATUS_t rxStatus = (AT86RF233_REG_RX_STATUS_t)samr21TrxSpiReadByteRaw();

    samr21TrxSpiCloseAccess();

    if (
        otMacFrameIsAck(&s_txAckFrame) && rxStatus.bit.crcValid && otMacFrameGetSequence(&s_txFrame) == otMacFrameGetSequence(&s_txAckFrame))
    {
        samr21RadioTxCleanup(true);
        return;
    }

