dresden-elektronik/openthread-r21/src/HAL/radio/samr21RadioTxHandler.c
ackInvalid:
    samr21RadioTxRetry();
}

void samr21RadioTxEventHandler(IrqEvent event)
{
    switch (event)
    {
    case TIMER_EVENT_4_TRIGGER:

        if (s_txStatus == TX_STATUS_WAIT_FOR_DELAYED_START)
        {
            samr21RadioTxStart();
            return;
        }

        if (s_txStatus == TX_STATUS_SENDING_BUSY_MIC)
        {
            samr21RadioTxCalcMic();
            return;
        }

        if (s_txStatus == TX_STATUS_SENDING_WAIT_FOR_MIC)
        {
            samr21RadioTxUploadMic();
            return;
        }

        if (s_txStatus == TX_STATUS_CSMA_BACKOFF)
        {
            samr21RadioTxStartCCA();
            return;
        }

        if (s_txStatus == TX_STATUS_WAIT_FOR_ACK || s_txStatus == TX_STATUS_RECEIVING_ACK)
        {
            samr21RadioTxRetry();
            return;
        }

        // Timeout Something went wrong
        samr21RadioTxCleanup(false);
        return;

    case TRX_EVENT_CCA_ED_DONE:
        // Scan Done
        samr21RadioTxEvalCCA();
        return;

    case TRX_EVENT_TRX_END:
        if (s_txStatus == TX_STATUS_SENDING_WAIT_TRX_END)
        {
            PORT->Group[0].OUTCLR.reg = PORT_PA06;
            samr21RadioTxPrepareAckReception();
            return;
        }
        else if (s_txStatus == TX_STATUS_RECEIVING_ACK)
        {
            samr21RadioTxEvalAck();
            return;
        }

    case TRX_EVENT_RX_START:
        if (s_txStatus == TX_STATUS_WAIT_FOR_ACK)
        {
            samr21RadioTxAckReceptionStarted();
            return;
        }

    default:
        return;
    }
}
